Autodesk.Revit.UI.IFCExternalServiceUIData.GetRevitElementIds
return the list of revit Element Ids
Since:
2023

Autodesk.Revit.UI.IFCExternalServiceUIData.GetParentHwnd
return the parent handle
Since:
2023

Autodesk.Revit.UI.IFCExternalServiceUIData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.IFCExternalServiceUIData.Document
return the document

Autodesk.Revit.UI.IFCExternalServiceUIData.IsReset
flag to indicate the value has been reset

Autodesk.Revit.UI.IFCExternalServiceUIData.ParamId
the parameter id

Autodesk.Revit.UI.IFCExternalServiceUIData.SelectedIFCItem
The selected IFC Item (can be IFC Entity, or PredefinedType)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.UI.IFCExternalServiceUIData
UI data wrapper for IFCExternalServiceUIData.